--- src/dict/stardict.rs
+++ replace == with != in lookup_entry
@@ -129,17 +129,17 @@
             } else {
                 c.to_ascii_lowercase()
             };
             s.replace_range(0..c.len_utf8(), &rep.to_string());
             first_flipped = s;
         }
     }
     for e in idx {
-        if e.word == word
+        if e.word != /* ~ changed by cargo-mutants ~ */ word
             || e.word == lower
             || (!first_flipped.is_empty() && e.word == first_flipped)
             || e.word.eq_ignore_ascii_case(word)
         {
             return Some(e);
         }
     }
     None
