--- src/dict/stardict.rs
+++ replace || with && in lookup_entry
@@ -132,17 +132,17 @@
             s.replace_range(0..c.len_utf8(), &rep.to_string());
             first_flipped = s;
         }
     }
     for e in idx {
         if e.word == word
             || e.word == lower
             || (!first_flipped.is_empty() && e.word == first_flipped)
-            || e.word.eq_ignore_ascii_case(word)
+            && /* ~ changed by cargo-mutants ~ */ e.word.eq_ignore_ascii_case(word)
         {
             return Some(e);
         }
     }
     None
 }
 
 /// 按 sametypesequence 解析 .dict 区段（offset..offset+size）：
