--- src/dict/stardict.rs
+++ delete match arm "wordcount" in parse_ifo
@@ -41,19 +41,17 @@
     for line in text.lines() {
         let line = line.trim();
         if line.is_empty() || line.starts_with('#') {
             continue;
         }
         let Some((k, v)) = line.split_once('=') else { continue };
         match k.trim() {
             "bookname" => bookname = v.trim().to_string(),
-            "wordcount" => {
-                wordcount = v.trim().parse::<u64>().ok().or(wordcount);
-            }
+             /* ~ changed by cargo-mutants ~ */
             "idxfilesize" => {
                 idxfilesize = v.trim().parse::<u64>().ok().or(idxfilesize);
             }
             "sametypesequence" => sametypesequence = Some(v.trim().to_string()),
             _ => {}
         }
     }
     let wordcount = wordcount
