--- src/dict/stardict.rs
+++ delete match arm "idxfilesize" in parse_ifo
@@ -44,19 +44,17 @@
             continue;
         }
         let Some((k, v)) = line.split_once('=') else { continue };
         match k.trim() {
             "bookname" => bookname = v.trim().to_string(),
             "wordcount" => {
                 wordcount = v.trim().parse::<u64>().ok().or(wordcount);
             }
-            "idxfilesize" => {
-                idxfilesize = v.trim().parse::<u64>().ok().or(idxfilesize);
-            }
+             /* ~ changed by cargo-mutants ~ */
             "sametypesequence" => sametypesequence = Some(v.trim().to_string()),
             _ => {}
         }
     }
     let wordcount = wordcount
         .ok_or_else(|| Error::Corrupt(format!("词库 .ifo 缺少 wordcount 字段: {}", path.display())))?;
     if bookname.is_empty() {
         bookname = path
