--- src/dict/stardict.rs
+++ replace == with != in load_idx
@@ -78,17 +78,17 @@
 pub(crate) fn load_idx(idx_bytes: &[u8]) -> Result<Vec<IdxEntry>> {
     let mut out = Vec::new();
     let mut pos = 0usize;
     while pos < idx_bytes.len() {
         // 尾部全 0 视为填充忽略（部分工具生成的 idx 带对齐 padding）
         if idx_bytes[pos..].iter().all(|&b| b == 0) {
             break;
         }
-        let nul = match idx_bytes[pos..].iter().position(|&b| b == 0) {
+        let nul = match idx_bytes[pos..].iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ 0) {
             Some(n) => pos + n,
             None => {
                 return Err(Error::Corrupt("词库 .idx 条目缺少 word 终止符（截断）".into()));
             }
         };
         let word = String::from_utf8_lossy(&idx_bytes[pos..nul]).into_owned();
         let tail_start = nul + 1;
         if tail_start + 8 > idx_bytes.len() {
