--- src/dict/stardict.rs
+++ replace + with - in load_idx
@@ -86,17 +86,17 @@
         let nul = match idx_bytes[pos..].iter().position(|&b| b == 0) {
             Some(n) => pos + n,
             None => {
                 return Err(Error::Corrupt("词库 .idx 条目缺少 word 终止符（截断）".into()));
             }
         };
         let word = String::from_utf8_lossy(&idx_bytes[pos..nul]).into_owned();
         let tail_start = nul + 1;
-        if tail_start + 8 > idx_bytes.len() {
+        if tail_start - /* ~ changed by cargo-mutants ~ */ 8 > idx_bytes.len() {
             return Err(Error::Corrupt("词库 .idx 条目偏移/长度字段截断".into()));
         }
         let offset = u32::from_be_bytes([
             idx_bytes[tail_start],
             idx_bytes[tail_start + 1],
             idx_bytes[tail_start + 2],
             idx_bytes[tail_start + 3],
         ]);
