--- src/dict/mod.rs
+++ replace extract_pos -> Option<String> with Some(String::new())
@@ -45,34 +45,17 @@
     fn translate(&self, text: &str, from: Lang, to: Lang) -> Result<Translation>;
     /// 运行时更新凭据（设置页改 key 后无需重建 Provider）；默认 no-op（Echo 忽略）
     fn configure(&mut self, _key: Option<&str>) {}
 }
 
 /// 释义首词性标记启发式：剥 HTML 后扫描前几行的行首 "n."/"vt."/"adj."…；无则 None。
 /// langdao 等真实词库的 m 字段形如 "*['æpl]\nn. 苹果, 家伙"（标记在次行行首）。
 pub(crate) fn extract_pos(definition: &str) -> Option<String> {
-    let stripped = strip_html_tags(definition);
-    // 长标记优先（vt./vi./prep. 等避免被 v./n. 前缀误吞）
-    const MARKERS: [&str; 15] = [
-        "interj.", "prep.", "conj.", "pron.", "num.", "art.", "aux.",
-        "abbr.", "adj.", "adv.", "vt.", "vi.", "n.", "v.", "int.",
-    ];
-    for line in stripped.lines().take(4) {
-        let t = line.trim_start();
-        if t.is_empty() {
-            continue;
-        }
-        for m in MARKERS {
-            if t.starts_with(m) {
-                return Some(m.to_string());
-            }
-        }
-    }
-    None
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// 极简 HTML 标签剥离（仅用于词性启发式与 UI 展示兜底；g 字段释义仍原样保留于
 /// `DictEntry.definition`，02-design §8 已知取舍6）。
 pub(crate) fn strip_html_tags(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut in_tag = false;
     for c in s.chars() {
