--- src/dict/mod.rs
+++ delete ! in strip_html_tags
@@ -74,14 +74,14 @@
 /// `DictEntry.definition`，02-design §8 已知取舍6）。
 pub(crate) fn strip_html_tags(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut in_tag = false;
     for c in s.chars() {
         match c {
             '<' => in_tag = true,
             '>' if in_tag => in_tag = false,
-            _ if !in_tag => out.push(c),
+            _ if  /* ~ changed by cargo-mutants ~ */in_tag => out.push(c),
             _ => {}
         }
     }
     out
 }
