--- src/dict/mod.rs
+++ replace match guard in_tag with false in strip_html_tags
@@ -73,17 +73,17 @@
 /// 极简 HTML 标签剥离（仅用于词性启发式与 UI 展示兜底；g 字段释义仍原样保留于
 /// `DictEntry.definition`，02-design §8 已知取舍6）。
 pub(crate) fn strip_html_tags(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut in_tag = false;
     for c in s.chars() {
         match c {
             '<' => in_tag = true,
-            '>' if in_tag => in_tag = false,
+            '>' if false /* ~ changed by cargo-mutants ~ */ => in_tag = false,
             _ if !in_tag => out.push(c),
             _ => {}
         }
     }
     out
 }
 
 #[cfg(test)]
