--- src/dict/provider.rs
+++ replace <impl TranslationProvider for EchoProvider>::translate -> Result<Translation> with Ok(Default::default())
@@ -71,22 +71,17 @@
 pub struct EchoProvider;
 
 impl TranslationProvider for EchoProvider {
     fn name(&self) -> &str {
         "echo"
     }
 
     fn translate(&self, text: &str, from: Lang, to: Lang) -> Result<Translation> {
-        Ok(Translation {
-            text: format!("译文:{text}"),
-            from,
-            to,
-            provider: self.name().to_string(),
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// 构造 DeepL 请求体（纯函数：把"只含 text/from/to"的隐私约束与 Auto 分支抽成
 /// 可无网络单测的结构单元；行为与内联版完全一致，rework-D 仅做提取不改语义）。
 /// 隐私（US-9/US-13）：请求体只含 text/target_lang[/source_lang]，无书路径/元数据。
 /// Auto（自动检测）不传 source_lang（DeepL 语义）。
 fn deepl_body(text: &str, from: Lang, to: Lang) -> serde_json::Value {
