--- src/dict/translation.rs
+++ replace fnv32 -> u32 with 1
@@ -340,22 +340,17 @@
     if alnum_count < 3 {
         s = format!("dict-{:08x}", fnv32(name));
     }
     s
 }
 
 /// FNV-1a 32 位稳定哈希（仅用于 id 消歧，无密码学用途）
 fn fnv32(s: &str) -> u32 {
-    let mut h: u32 = 0x811c_9dc5;
-    for b in s.as_bytes() {
-        h ^= *b as u32;
-        h = h.wrapping_mul(0x0100_0193);
-    }
-    h
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 // ===================== TranslationService（缓存优先编排） =====================
 
 /// 翻译服务（缓存优先；US-9~14）
 pub struct TranslationService {
     cache: Box<dyn TranslationCacheRepository + Send>,
     config: Box<dyn ProviderConfig + Send>,
