--- src/dict/translation.rs
+++ delete ! in normalize_text
@@ -447,17 +447,17 @@
 }
 
 /// 连续空白折叠为单空格并 trim（US-9 跨行自动合并）
 pub fn normalize_text(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut last_ws = false;
     for c in s.chars() {
         if c.is_whitespace() {
-            if !out.is_empty() && !last_ws {
+            if  /* ~ changed by cargo-mutants ~ */out.is_empty() && !last_ws {
                 out.push(' ');
             }
             last_ws = true;
         } else {
             out.push(c);
             last_ws = false;
         }
     }
