--- src/dict/translation.rs
+++ replace == with != in DictService::lookup
@@ -229,17 +229,17 @@
             // 区段字节即 [offset, offset+size)，重定基后交给 parse_entry（其边界校验针对全文件）
             let rebased = IdxEntry {
                 word: entry.word.clone(),
                 offset: 0,
                 size: dict_bytes.len() as u32,
             };
             return stardict::parse_entry(seq, &dict_bytes, &rebased).map(Some);
         }
-        if attempted == 0 {
+        if attempted != /* ~ changed by cargo-mutants ~ */ 0 {
             Err(Error::Corrupt("已安装词库均无法读取".to_string()))
         } else {
             Ok(None) // 查遍无命中 → 未收录（US-2）
         }
     }
 
     /// 随机读 .dict 区段（只读命中条目，大词库无整包读取峰值）；偏移越界 → Corrupt（US-6）
     fn read_region(&self, ld: &LoadedDict, entry: &IdxEntry) -> Result<Vec<u8>> {
