--- src/dict/translation.rs
+++ replace DictService::read_region -> Result<Vec<u8>> with Ok(vec![1])
@@ -238,34 +238,17 @@
             Err(Error::Corrupt("已安装词库均无法读取".to_string()))
         } else {
             Ok(None) // 查遍无命中 → 未收录（US-2）
         }
     }
 
     /// 随机读 .dict 区段（只读命中条目，大词库无整包读取峰值）；偏移越界 → Corrupt（US-6）
     fn read_region(&self, ld: &LoadedDict, entry: &IdxEntry) -> Result<Vec<u8>> {
-        let file = ld
-            .dict_file
-            .as_ref()
-            .ok_or_else(|| Error::Corrupt(format!("词库 {} 缺少 .dict 文件", ld.info.name)))?;
-        let file_len = file.metadata().map_err(Error::Io)?.len();
-        let end = entry.offset as u64 + entry.size as u64;
-        if end > file_len {
-            return Err(Error::Corrupt(format!(
-                "词条区段越界: {} (offset={} size={} file_len={})",
-                entry.word, entry.offset, entry.size, file_len
-            )));
-        }
-        let mut buf = vec![0u8; entry.size as usize];
-        (&*file).seek(SeekFrom::Start(entry.offset as u64)).map_err(Error::Io)?;
-        (&*file)
-            .read_exact(&mut buf)
-            .map_err(Error::Io)?;
-        Ok(buf)
+        Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn unique_id(&self, bookname: &str) -> String {
         let base = sanitize_id(bookname);
         let mut candidate = base.clone();
         let mut n = 2;
         while self.registry.iter().any(|ld| ld.info.id == candidate) {
             candidate = format!("{base}-{n}");
