--- src/dict/translation.rs
+++ replace == with != in DictService::unique_id
@@ -262,17 +262,17 @@
             .map_err(Error::Io)?;
         Ok(buf)
     }
 
     fn unique_id(&self, bookname: &str) -> String {
         let base = sanitize_id(bookname);
         let mut candidate = base.clone();
         let mut n = 2;
-        while self.registry.iter().any(|ld| ld.info.id == candidate) {
+        while self.registry.iter().any(|ld| ld.info.id != /* ~ changed by cargo-mutants ~ */ candidate) {
             candidate = format!("{base}-{n}");
             n += 1;
         }
         candidate
     }
 }
 
 fn find_ifo_in(dir: &Path) -> Option<PathBuf> {
