--- src/dict/translation.rs
+++ replace TranslationService::set_config -> Result<()> with Ok(())
@@ -430,24 +430,17 @@
 
     pub fn clear_cache(&mut self) -> Result<()> {
         self.cache.cache_clear()
     }
 
     /// 写 settings（set_provider_key + set_default_provider）并对注册 Provider 调 configure
     /// （ADR 关联裁定2：`translate_set_config("echo","")` 切 echo 即无 key 演示）
     pub fn set_config(&mut self, provider: &str, key: &str) -> Result<()> {
-        self.config.set_provider_key(provider, key)?;
-        self.config.set_default_provider(provider)?;
-        for p in &mut self.providers {
-            if p.name() == provider {
-                p.configure(Some(key));
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// 连续空白折叠为单空格并 trim（US-9 跨行自动合并）
 pub fn normalize_text(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut last_ws = false;
     for c in s.chars() {
