--- src/store/translation.rs
+++ replace <impl ProviderConfig for TranslationRepo>::default_provider -> Result<String> with Ok("xyzzy".into())
@@ -121,26 +121,17 @@
             .query_row("SELECT COUNT(*) FROM translation_cache", [], |r| r.get(0))
             .map_err(Error::from)?;
         Ok(n as u64)
     }
 }
 
 impl ProviderConfig for TranslationRepo {
     fn default_provider(&self) -> Result<String> {
-        let v: Option<String> = self
-            .conn
-            .query_row(
-                "SELECT value FROM settings WHERE key=?1",
-                params![KEY_DEFAULT_PROVIDER],
-                |r| r.get(0),
-            )
-            .optional()
-            .map_err(Error::from)?;
-        Ok(v.unwrap_or_else(|| DEFAULT_PROVIDER.to_string()))
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn provider_key(&self, provider: &str) -> Result<Option<String>> {
         self.conn
             .query_row(
                 "SELECT value FROM settings WHERE key=?1",
                 params![Self::provider_key_setting(provider)],
                 |r| r.get(0),
