--- src/library/mod.rs
+++ replace LibraryService::canonical_path -> Result<std::path::PathBuf> with Ok(Default::default())
@@ -104,21 +104,17 @@
     }
 
     /// 读取阅读进度
     pub fn load_progress(&self, id: &str) -> Result<Option<crate::store::ProgressRecord>> {
         self.store.load_progress(id)
     }
 
     fn canonical_path(&self, id: &str) -> Result<std::path::PathBuf> {
-        let record = self.store.get_book(id)?;
-        record
-            .canonical_path
-            .map(std::path::PathBuf::from)
-            .ok_or_else(|| Error::Corrupt("书籍缺少规范缓存".into()))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn remove(&mut self, id: &str) -> Result<()> {
         self.store.remove_book(id)
     }
 }
 
 fn sha256_of_file(path: &Path) -> Result<String> {
