--- src/library/mod.rs
+++ replace LibraryService::remove -> Result<()> with Ok(())
@@ -112,17 +112,17 @@
         let record = self.store.get_book(id)?;
         record
             .canonical_path
             .map(std::path::PathBuf::from)
             .ok_or_else(|| Error::Corrupt("书籍缺少规范缓存".into()))
     }
 
     pub fn remove(&mut self, id: &str) -> Result<()> {
-        self.store.remove_book(id)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn sha256_of_file(path: &Path) -> Result<String> {
     let bytes = std::fs::read(path).map_err(Error::Io)?;
     Ok(sha256_hex(&bytes))
 }
 
