--- src/library/mod.rs
+++ replace sha256_hex -> String with "xyzzy".into()
@@ -122,22 +122,17 @@
 }
 
 fn sha256_of_file(path: &Path) -> Result<String> {
     let bytes = std::fs::read(path).map_err(Error::Io)?;
     Ok(sha256_hex(&bytes))
 }
 
 fn sha256_hex(bytes: &[u8]) -> String {
-    let digest = Sha256::digest(bytes);
-    let mut s = String::with_capacity(64);
-    for b in digest.iter() {
-        s.push_str(&format!("{b:02x}"));
-    }
-    s
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn write_tmp_txt(dir: &Path, name: &str, content: &str) -> PathBuf {
         let p = dir.join(name);
