--- src/library/mod.rs
+++ replace LibraryService::chapter_html -> Result<String> with Ok("xyzzy".into())
@@ -83,18 +83,17 @@
         Ok(OpenedBook {
             record,
             chapters: parsed.chapters,
         })
     }
 
     /// 读取规范 EPUB 中指定章节的原始 HTML（WebView 渲染用，REQ-001）
     pub fn chapter_html(&self, id: &str, href: &str) -> Result<String> {
-        let canonical = self.canonical_path(id)?;
-        crate::format::epub::chapter_html(&canonical, href)
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 读取规范 EPUB 中指定资源字节（图片/CSS/字体）
     pub fn resource(&self, id: &str, name: &str) -> Result<Vec<u8>> {
         let canonical = self.canonical_path(id)?;
         crate::format::epub::resource(&canonical, name)
     }
 
