--- src/store/mod.rs
+++ replace Store::load_progress -> Result<Option<ProgressRecord>> with Ok(None)
@@ -117,32 +117,17 @@
                 rusqlite::params![book_id, href, progression, now],
             )
             .map_err(Error::from)?;
         Ok(())
     }
 
     /// 读取阅读进度
     pub fn load_progress(&self, book_id: &str) -> Result<Option<ProgressRecord>> {
-        let mut stmt = self
-            .conn
-            .prepare(
-                "SELECT href, progression, updated_at FROM reading_progress WHERE book_id = ?1",
-            )
-            .map_err(Error::from)?;
-        let mut rows = stmt
-            .query_map(rusqlite::params![book_id], |r| {
-                Ok(ProgressRecord {
-                    href: r.get(0)?,
-                    progression: r.get(1)?,
-                    updated_at: r.get(2)?,
-                })
-            })
-            .map_err(Error::from)?;
-        rows.next().transpose().map_err(Error::from)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn insert_book(&mut self, record: &BookRecord) -> Result<()> {
         let authors = serde_json::to_string(&record.authors)
             .map_err(|e| Error::Other(format!("authors 序列化失败: {e}")))?;
         let now = now_unix();
         self.conn
             .execute(
