--- src/store/mod.rs
+++ replace Store::list_books -> Result<Vec<BookRecord>> with Ok(vec![])
@@ -167,46 +167,17 @@
                     rusqlite::params![record.id, canonical],
                 )
                 .map_err(Error::from)?;
         }
         Ok(())
     }
 
     pub fn list_books(&self) -> Result<Vec<BookRecord>> {
-        let mut stmt = self
-            .conn
-            .prepare(
-                "SELECT b.id, b.title, b.authors, b.language, b.source_path, b.source_hash, b.format, b.added_at, f.canonical_path
-                 FROM books b LEFT JOIN book_files f ON f.book_id = b.id
-                 ORDER BY b.added_at DESC",
-            )
-            .map_err(Error::from)?;
-        let rows = stmt
-            .query_map([], |r| {
-                let authors_json: String = r.get(2)?;
-                let authors = serde_json::from_str(&authors_json).unwrap_or_default();
-                Ok(BookRecord {
-                    id: r.get(0)?,
-                    title: r.get(1)?,
-                    authors,
-                    language: r.get(3)?,
-                    source_path: r.get(4)?,
-                    source_hash: r.get(5)?,
-                    format: r.get(6)?,
-                    added_at: r.get(7)?,
-                    canonical_path: r.get(8)?,
-                })
-            })
-            .map_err(Error::from)?;
-        let mut out = Vec::new();
-        for row in rows {
-            out.push(row.map_err(Error::from)?);
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_book(&self, id: &str) -> Result<BookRecord> {
         let mut stmt = self
             .conn
             .prepare(
                 "SELECT b.id, b.title, b.authors, b.language, b.source_path, b.source_hash, b.format, b.added_at, f.canonical_path
                  FROM books b LEFT JOIN book_files f ON f.book_id = b.id WHERE b.id = ?1",
