--- src/store/mod.rs
+++ replace Store::open -> Result<Store> with Ok(Default::default())
@@ -36,27 +36,17 @@
     pub href: String,
     pub progression: f32,
     pub updated_at: i64,
 }
 
 impl Store {
     /// 打开（或创建）书库；自动执行迁移。
     pub fn open(data_dir: &Path) -> Result<Store> {
-        std::fs::create_dir_all(data_dir).map_err(Error::Io)?;
-        std::fs::create_dir_all(data_dir.join("cache")).map_err(Error::Io)?;
-        let conn = Connection::open(data_dir.join("library.db")).map_err(Error::from)?;
-        conn.execute_batch("PRAGMA journal_mode=WAL; PRAGMA foreign_keys=ON;")
-            .map_err(Error::from)?;
-        let store = Store {
-            conn,
-            data_dir: data_dir.to_path_buf(),
-        };
-        store.migrate()?;
-        Ok(store)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn cache_dir(&self) -> std::path::PathBuf {
         self.data_dir.join("cache")
     }
 
     fn migrate(&self) -> Result<()> {
         let version: i64 = self
