--- src/store/mod.rs
+++ replace Store::cache_dir -> std::path::PathBuf with Default::default()
@@ -50,17 +50,17 @@
             conn,
             data_dir: data_dir.to_path_buf(),
         };
         store.migrate()?;
         Ok(store)
     }
 
     pub fn cache_dir(&self) -> std::path::PathBuf {
-        self.data_dir.join("cache")
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn migrate(&self) -> Result<()> {
         let version: i64 = self
             .conn
             .query_row("PRAGMA user_version", [], |r| r.get(0))
             .map_err(Error::from)?;
         if version < 1 {
