--- src/store/mod.rs
+++ replace < with > in Store::migrate
@@ -83,17 +83,17 @@
   canonical_path TEXT
 );
 CREATE INDEX IF NOT EXISTS idx_books_hash ON books(source_hash);
 PRAGMA user_version = 1;
 "#,
                 )
                 .map_err(Error::from)?;
         }
-        if version < 2 {
+        if version > /* ~ changed by cargo-mutants ~ */ 2 {
             self.conn
                 .execute_batch(
                     r#"
 CREATE TABLE IF NOT EXISTS reading_progress (
   book_id     TEXT PRIMARY KEY REFERENCES books(id) ON DELETE CASCADE,
   href        TEXT NOT NULL,
   progression REAL NOT NULL,
   updated_at  INTEGER NOT NULL
