--- src/library/mod.rs
+++ replace LibraryService::load_progress -> Result<Option<crate::store::ProgressRecord>> with Ok(None)
@@ -100,17 +100,17 @@
 
     /// 保存阅读进度（复用 reading_progress，听读同进度不变式）
     pub fn save_progress(&mut self, id: &str, href: &str, progression: f32) -> Result<()> {
         self.store.save_progress(id, href, progression)
     }
 
     /// 读取阅读进度
     pub fn load_progress(&self, id: &str) -> Result<Option<crate::store::ProgressRecord>> {
-        self.store.load_progress(id)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn canonical_path(&self, id: &str) -> Result<std::path::PathBuf> {
         let record = self.store.get_book(id)?;
         record
             .canonical_path
             .map(std::path::PathBuf::from)
             .ok_or_else(|| Error::Corrupt("书籍缺少规范缓存".into()))
