--- src/library/mod.rs
+++ replace LibraryService::import_file -> Result<BookRecord> with Ok(Default::default())
@@ -25,43 +25,17 @@
 impl LibraryService {
     pub fn new(store: Store) -> Self {
         LibraryService { store }
     }
 
     /// 导入一个文件：嗅探格式 → 解析 → 规范 EPUB 缓存 → 入库。
     /// 返回书籍记录；内容重复（同 hash）时返回既有记录（不重复入库）。
     pub fn import_file(&mut self, path: &Path) -> Result<BookRecord> {
-        let hash = sha256_of_file(path)?;
-        if let Some(existing) = self
-            .store
-            .list_books()?
-            .into_iter()
-            .find(|b| b.source_hash == hash)
-        {
-            return Ok(existing);
-        }
-
-        let parsed = format::parse(path)?;
-        let id = format!("bk_{}", &hash[..16]);
-        let canonical_path = self.canonicalize_cached(&hash, &parsed)?;
-
-        let record = BookRecord {
-            id,
-            title: parsed.title.clone(),
-            authors: parsed.authors.clone(),
-            language: parsed.language.clone(),
-            source_path: path.display().to_string(),
-            source_hash: hash,
-            format: parsed.format.name().to_string(),
-            canonical_path: Some(canonical_path.display().to_string()),
-            added_at: 0,
-        };
-        self.store.insert_book(&record)?;
-        Ok(record)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 规范 EPUB 缓存：cache/<hash>.epub，命中直接复用
     fn canonicalize_cached(&self, hash: &str, parsed: &ParsedBook) -> Result<PathBuf> {
         let path = self.store.cache_dir().join(format!("{hash}.epub"));
         if !path.exists() {
             crate::convert::BookCanonicalizer::canonicalize(parsed, &path)?;
         }
