--- src/library/mod.rs
+++ replace LibraryService::list -> Result<Vec<BookRecord>> with Ok(vec![Default::default()])
@@ -64,17 +64,17 @@
         let path = self.store.cache_dir().join(format!("{hash}.epub"));
         if !path.exists() {
             crate::convert::BookCanonicalizer::canonicalize(parsed, &path)?;
         }
         Ok(path)
     }
 
     pub fn list(&self) -> Result<Vec<BookRecord>> {
-        self.store.list_books()
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 打开书：读取规范 EPUB 缓存并解析出章节（含纯文本）。
     pub fn open_book(&self, id: &str) -> Result<OpenedBook> {
         let record = self.store.get_book(id)?;
         let canonical = record
             .canonical_path
             .as_ref()
