--- src/library/mod.rs
+++ replace LibraryService::open_book -> Result<OpenedBook> with Ok(Default::default())
@@ -69,26 +69,17 @@
     }
 
     pub fn list(&self) -> Result<Vec<BookRecord>> {
         self.store.list_books()
     }
 
     /// 打开书：读取规范 EPUB 缓存并解析出章节（含纯文本）。
     pub fn open_book(&self, id: &str) -> Result<OpenedBook> {
-        let record = self.store.get_book(id)?;
-        let canonical = record
-            .canonical_path
-            .as_ref()
-            .ok_or_else(|| Error::Corrupt("书籍缺少规范缓存".into()))?;
-        let parsed = format::parse(Path::new(canonical))?;
-        Ok(OpenedBook {
-            record,
-            chapters: parsed.chapters,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 读取规范 EPUB 中指定章节的原始 HTML（WebView 渲染用，REQ-001）
     pub fn chapter_html(&self, id: &str, href: &str) -> Result<String> {
         let canonical = self.canonical_path(id)?;
         crate::format::epub::chapter_html(&canonical, href)
     }
 
