--- src/store/mod.rs
+++ replace Store::save_progress -> Result<()> with Ok(())
@@ -103,26 +103,17 @@
                 )
                 .map_err(Error::from)?;
         }
         Ok(())
     }
 
     /// 保存阅读进度（同一本书一行，UPSERT）
     pub fn save_progress(&mut self, book_id: &str, href: &str, progression: f32) -> Result<()> {
-        let now = now_unix();
-        self.conn
-            .execute(
-                "INSERT INTO reading_progress (book_id, href, progression, updated_at)
-                 VALUES (?1, ?2, ?3, ?4)
-                 ON CONFLICT(book_id) DO UPDATE SET href=?2, progression=?3, updated_at=?4",
-                rusqlite::params![book_id, href, progression, now],
-            )
-            .map_err(Error::from)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// 读取阅读进度
     pub fn load_progress(&self, book_id: &str) -> Result<Option<ProgressRecord>> {
         let mut stmt = self
             .conn
             .prepare(
                 "SELECT href, progression, updated_at FROM reading_progress WHERE book_id = ?1",
