--- src/store/mod.rs
+++ replace Store::insert_book -> Result<()> with Ok(())
@@ -136,44 +136,17 @@
                     updated_at: r.get(2)?,
                 })
             })
             .map_err(Error::from)?;
         rows.next().transpose().map_err(Error::from)
     }
 
     pub fn insert_book(&mut self, record: &BookRecord) -> Result<()> {
-        let authors = serde_json::to_string(&record.authors)
-            .map_err(|e| Error::Other(format!("authors 序列化失败: {e}")))?;
-        let now = now_unix();
-        self.conn
-            .execute(
-                "INSERT OR REPLACE INTO books (id, title, authors, language, source_path, source_hash, format, added_at, updated_at)
-                 VALUES (?1, ?2, ?3, ?4, ?5, ?6, ?7, ?8, ?8)",
-                rusqlite::params![
-                    record.id,
-                    record.title,
-                    authors,
-                    record.language,
-                    record.source_path,
-                    record.source_hash,
-                    record.format,
-                    now
-                ],
-            )
-            .map_err(Error::from)?;
-        if let Some(canonical) = &record.canonical_path {
-            self.conn
-                .execute(
-                    "INSERT OR REPLACE INTO book_files (book_id, canonical_path) VALUES (?1, ?2)",
-                    rusqlite::params![record.id, canonical],
-                )
-                .map_err(Error::from)?;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn list_books(&self) -> Result<Vec<BookRecord>> {
         let mut stmt = self
             .conn
             .prepare(
                 "SELECT b.id, b.title, b.authors, b.language, b.source_path, b.source_hash, b.format, b.added_at, f.canonical_path
                  FROM books b LEFT JOIN book_files f ON f.book_id = b.id
