--- src/store/mod.rs
+++ replace Store::get_book -> Result<BookRecord> with Ok(Default::default())
@@ -200,46 +200,17 @@
         let mut out = Vec::new();
         for row in rows {
             out.push(row.map_err(Error::from)?);
         }
         Ok(out)
     }
 
     pub fn get_book(&self, id: &str) -> Result<BookRecord> {
-        let mut stmt = self
-            .conn
-            .prepare(
-                "SELECT b.id, b.title, b.authors, b.language, b.source_path, b.source_hash, b.format, b.added_at, f.canonical_path
-                 FROM books b LEFT JOIN book_files f ON f.book_id = b.id WHERE b.id = ?1",
-            )
-            .map_err(Error::from)?;
-        let row = stmt
-            .query_row(rusqlite::params![id], |r| {
-                let authors_json: String = r.get(2)?;
-                let authors = serde_json::from_str(&authors_json).unwrap_or_default();
-                Ok(BookRecord {
-                    id: r.get(0)?,
-                    title: r.get(1)?,
-                    authors,
-                    language: r.get(3)?,
-                    source_path: r.get(4)?,
-                    source_hash: r.get(5)?,
-                    format: r.get(6)?,
-                    added_at: r.get(7)?,
-                    canonical_path: r.get(8)?,
-                })
-            })
-            .map_err(|e| match e {
-                rusqlite::Error::QueryReturnedNoRows => {
-                    Error::NotFound(format!("书籍不存在: {id}"))
-                }
-                other => Error::from(other),
-            })?;
-        Ok(row)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn remove_book(&mut self, id: &str) -> Result<()> {
         self.conn
             .execute("DELETE FROM books WHERE id = ?1", rusqlite::params![id])
             .map_err(Error::from)?;
         Ok(())
     }
