--- src/store/mod.rs
+++ replace < with == in Store::migrate
@@ -58,17 +58,17 @@
         self.data_dir.join("cache")
     }
 
     fn migrate(&self) -> Result<()> {
         let version: i64 = self
             .conn
             .query_row("PRAGMA user_version", [], |r| r.get(0))
             .map_err(Error::from)?;
-        if version < 1 {
+        if version == /* ~ changed by cargo-mutants ~ */ 1 {
             self.conn
                 .execute_batch(
                     r#"
 CREATE TABLE IF NOT EXISTS books (
   id            TEXT PRIMARY KEY,
   title         TEXT NOT NULL,
   authors       TEXT NOT NULL DEFAULT '[]',
   language      TEXT,
